In [4]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(r"c:\classroom\hr.db")

In [6]:
df = pd.read_sql("select * from employees",con)

In [7]:
df

   id         fullname    job   salary
0   1  Stephen Walther   SPRO  1000000
1   2     Jason Hunter    DBA  1500000
2   3      Joe Stagner  SPROG  1300000
3   4       Bob Tabour     TL  2500000
4   5    Jessy Liberty   PROG   500000
5   6     James Miller    DBA  1200000
6   8       Larry Page    CEO  3000000
7   9     Jason Hunter    CTO  2000000
8  10       Bob Tabour    CFO  2000000
9  11     Rama Velpuri         2500000

In [8]:
df.groupby('job')['salary'].median()

job
         2500000
CEO      3000000
CFO      2000000
CTO      2000000
DBA      1350000
PROG      500000
SPRO     1000000
SPROG    1300000
TL       2500000
Name: salary, dtype: int64

In [11]:
df.to_sql("old_employees",con, index=False)

### Excel Sheet

In [14]:
df.to_excel(r"c:\classroom\hr.xlsx", sheet_name="employees", index=False)